Autodesk.Revit.DB.STEPExportOptions.Description
A description of the export to be saved in the output STEP file.
Since:
2025

Autodesk.Revit.DB.STEPExportOptions.Organization
An organization name can be saved in the output STEP file.
Since:
2025

Autodesk.Revit.DB.STEPExportOptions.Author
An author can be saved in the output STEP file.
Since:
2025

Autodesk.Revit.DB.STEPExportOptions.ApplicationProtocol
The Application Protocol of the exported STEP file.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.STEPExportOptions.TargetUnit
The unit type of geometry in the resultant STEP file.
Default value is ExportUnit::Default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.STEPExportOptions.#ctor
Constructs a new instance of STEPExportOptions with default values of all properties.
Since:
2025

Autodesk.Revit.DB.STEPExportOptions
The export options used by exporting STEP format file.
Since:
2025